Fo1Go/stm32g474_lab_works/LR2 task2.c

#include "stm32g474xx.h"


void EXTI15_10_IRQHandler() {
	if(EXTI->PR1 & EXTI_PR1_PIF13) {
		if((GPIOB -> IDR & GPIO_IDR_ID13) == 0) {
			GPIOE -> ODR |= GPIO_ODR_OD7;
			GPIOD -> ODR |= GPIO_ODR_OD0;
		} else if (GPIOB -> IDR & GPIO_IDR_ID13) {
			GPIOE -> ODR &= ~GPIO_ODR_OD7;
			GPIOD -> ODR &= ~GPIO_ODR_OD0;
		}
		EXTI->PR1 |= EXTI_PR1_PIF13;
	}
}

int main(void) {
	RCC -> AHB2ENR |= RCC_AHB2ENR_GPIOEEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIODEN;
	RCC -> APB2ENR |= RCC_APB2ENR_SYSCFGEN;

	SYSCFG -> EXTICR[3] |= SYSCFG_EXTICR4_EXTI13_PB;
	EXTI -> IMR1 |= EXTI_IMR1_IM13;
	EXTI -> RTSR1 |= EXTI_RTSR1_RT13;
	EXTI -> FTSR1 |= EXTI_FTSR1_FT13;

	NVIC_EnableIRQ(EXTI15_10_IRQn);

	GPIOE -> MODER &= ~GPIO_MODER_MODE7_Msk; GPIOE -> MODER |= 1 << GPIO_MODER_MODE7_Pos;
	GPIOD -> MODER &= ~GPIO_MODER_MODE0_Msk; GPIOD -> MODER |= 1 << GPIO_MODER_MODE0_Pos;
	GPIOB -> MODER &= ~GPIO_MODER_MODE13_Msk; GPIOB -> MODER |= 0 << GPIO_MODER_MODE13_Pos;

	while(1) {

	}
}
